package ru.itpark;

import ru.itpark.model.AbstractTariff;
import ru.itpark.model.OtherTariff;
import ru.itpark.model.TariffForDevice;
import ru.itpark.model.TurnOnTariff;

public class Main {
    public static void main(String[] args) {
        AbstractTariff[] tariff = new AbstractTariff[15];
        tariff[0] = new TurnOnTariff(
                1,
                "Включайся! Смотри",
                650,
                " за 30 дней",
                "Выбрать",
                "Подробнее",
                0,
                1_200,
                "Кино и сериалы в МегаФон ТВ",
                null,
                "Кэшбэк до 30%",
                300);
        tariff[1] = new TurnOnTariff(
                2,
                "Включайся! Общайся",
                350,
                " за 30 дней",
                "Выбрать",
                "Подробнее",
                0,
                600,
                "Всегда оставайтесь на связи",
                null,
                "Кэшбэк до 30%",
                0);
        tariff[2] = new TurnOnTariff(
                3,
                "Включайся! Развлекайся",
                300,
                " за 30 дней",
                "Выбрать",
                "Подробнее",
                10,
                100,
                "Безлимитный интернет на популярные сервисы",
                null,
                "Кэшбэк до 30%",
                0);
        tariff[3] = new TurnOnTariff(
                4,
                "Включайся! Пиши",
                250,
                " за 30 дней",
                "Выбрать",
                "Подробнее",
                6 ,
                300,
                "Безлимитный интернет на мессенджеры",
                null,
                null,
                300);
        tariff[4] = new TurnOnTariff(
                5,
                "Включайся! Выбирай",
                260,
                " за 30 дней",
                "Выбрать",
                "Подробнее",
                10,
                300,
                "Гибкие настройки и выбор опций.",
                null,
                "Кэшбэк до 30%",
                300);
        tariff[5] = new TurnOnTariff(
                6,
                "Включайся! Премиум",
                2_000,
                " за 30 дней",
                "Выбрать",
                "Подробнее",
                0,
                4_000,
                "Безлимитные SMS",
                null,
                "Кэшбэк до 30%",
                0);
        tariff[6] = new TurnOnTariff(
                7,
                "Включайся! Говори",
                300,
                " за 30 дней", "Выбрать",
                "Подробнее",
                5,
                500,
                "Звонки на все номера России",
                "Безлимитный интернет на мессенджеры",
                "Кэшбэк до 30%",
                0);
        tariff[7] = new TariffForDevice(
                8,
                "Твой безлимит на 6 месяцев",
                3_100,
                null,
                "Выбрать",
                "Подробнее",
                "Безлимитный индернет",
                "Трафик без ограничений для использования дома и в поездках по России",
                null);
        tariff[8] = new TariffForDevice(
                9,
                "Твой безлимит на 6 месяцев",
                5_100,
                null,
                "Выбрать",
                "Подробнее",
                "Безлимитный интернет",
                "Трафик без ограничений для использования дома и в поездках по России",
                null);
        tariff[9] = new TariffForDevice(
                10,
                "Мегафон- Онлайн",
                0,
                " в месяц",
                "Выбрать",
                "Подробнее",
                "Оплата трафика по использованию",
                "Базовый тариф для подключения интернет-опций и использования на устройствах",
                " Оплата трафика по факту использования");
        tariff[10] = new OtherTariff(
                11,
                "Переходи на НОЛЬ",
                0,
                null,
                "Выбрать",
                "Подробнее",
                "Тариф без абонентской платы для выгодных звонков. Поминутная тарификация",
                "Поминутная тарификация",
                null);
        tariff[11] = new OtherTariff(
                12,
                "Теплый прием Акция",
                350,
                " в месяц",
                "Выбрать",
                "Подробнее",
                "Тариф для звонков в страны СНГ и Азии",
                "Безлимитный интернет",
                "Безлимитные звонки внутри сети");
        tariff[12] = new OtherTariff(
                13,
                "#Hello",
                750,
                " за 14 дней",
                null,
                "Подробнее",
                "Тариф для иностранных туристов",
                "30 Гб",
                "Безлимитные звонки внутри сети");
        tariff[13] = new OtherTariff(
                14,
                "Посекундный",
                0,
                null,
                null,
                "Подробнее",
                "Тариф без абонентской платы",
                "Посекундная тарификация",
                null);
        tariff[14] = new OtherTariff(
                15,
                "Умные вещи",
                20,
                " в неделю",
                "Выбрать",
                "Подробнее",
                "Тариф для умных устройств",
                "Безлимитный интернет",
                "Звонки и SMS на номера России");

        for (AbstractTariff results : tariff) {
            System.out.println(results);
        }
    }
}